function [stage,M_K,M_T,Time,P,M_PN] = Rocket_base (Rocket_Choise)
%Арсенал ракет, используемых в полигоне
%Формат вывода информации:
%[колличество ступеней, масса конструкции, масса топлива, время работы,
%Тяга ступени, масса полезной нагрузки]
%Все значения представленны в единицах измерения СИ

% if Rocket_Choise == 1  %Р-7
%     stage = 2;
%     M_K = [15000 6465]; 
%     M_T = [155000 87000];
%     Time = [140 320];
%     P = [821000 750000];
%     M_PN = 5300;
    
if Rocket_Choise == 1  %Р-36М "Сатана"
    stage = 2;
    M_K = [6400 3700]; 
    M_T = [115900 45600];
    Time = [120 160];
    P = [2600000 1000000];
    M_PN = 8000;
    
elseif Rocket_Choise == 2  %Союз-2
    stage = 3;
    M_K = [9300 2700 840]; 
    M_T = [118700 23300 900];
    Time = [185 270 900];
    P = [1600000 294300 3000];
    M_PN = 3000;    
    
elseif Rocket_Choise == 3  %falcon 9
    stage = 2;
    M_K = [22200 4000]; 
    M_T = [409500 103500];
    Time = [162 397];
    P = [6804000 935000];
    M_PN = 10000;   
    
elseif Rocket_Choise == 4  %Vega
    stage = 4;
    M_K = [9000 2500 1000 500]; 
    M_T = [88000 23900 10100 550];
    Time = [107 72 117 315];
    P = [3040000 1200000 213000 2450];
    M_PN = 1500;       
    
elseif Rocket_Choise == 5  %Ариан-5
    stage = 3;
    M_K = [13000 3000 1200]; 
    M_T = [140000 33000 8300];
    Time = [140 131 545];
    P = [2440000 7.1e5 6.0e4];
    M_PN = 4.05e3;       
    
    
%Задание своих характеристик
else
stage = inputdlg({'Выберете колличество ступеней:'});
stage = str2num(stage{1});

for i = 1:stage
MyPrompt={['Сухая масса ' num2str(i) '-й ступени, кг'], ...
            ['Масса топлива ' num2str(i) '-й ступени, кг'], ...
            ['Время работы двигателей ' num2str(i) '-й ступени, с'], ...
            ['суммарная тяга двигателей ' num2str(i) '-й ступени, Нт'] ...
           };    
title = ['Тягово-массовые характерристики ' num2str(i) '-й ступени'];       

Rocket = inputdlg(MyPrompt, title, [1 80]);
% Перевод данных в числа
    M_K(i)  = str2num (Rocket{1});
    M_T(i)  = str2num (Rocket{2});
    Time(i) = str2num (Rocket{3});
    P(i)    = str2num (Rocket{4});
 
end
    
M_PN = inputdlg({'Выберете массу полезной нагрузки, кг'});
M_PN = str2num(M_PN{1});

end